#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_bigquery_dataset.bidder will be created
  + resource "google_bigquery_dataset" "bidder" {
      + creation_time               = (known after apply)
      + dataset_id                  = "bidder"
      + default_collation           = (known after apply)
      + default_table_expiration_ms = 3600000
      + delete_contents_on_destroy  = false
      + description                 = "This is a bidder dataset"
      + etag                        = (known after apply)
      + friendly_name               = "bidder"
      + id                          = (known after apply)
      + is_case_insensitive         = (known after apply)
      + labels                      = {
          + "env" = "demo"
        }
      + last_modified_time          = (known after apply)
      + location                    = "US"
      + max_time_travel_hours       = (known after apply)
      + project                     = "bb-example-iac-01"
      + self_link                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @brucearctor, Action: `pull_request`, Working Directory: ``, Workflow: `.github/workflows/tf.yml`*